#include <stdio.h>

/*RS232/8N1 се дефинира така:
	- Началото на трансмисията започва със "start bit", 0 (ако няма нищо по линията, приемат се битове 1).
	- Следват 8 бита данни (LSB→MSB, least significant bit first, b0→b1→b2→b3→b4→b5→b6→b7)
	- Следва "stop bit", 1
На stdin се приема поток от '0'/'1'. Да се екстрактнат всички байтове и да се изведат на stdout при EOF.

Пример:
input: 111111111111111111111111111111111111111111010010101111111111111111111111111111111111111111111
output: 0xa9*/

int main(int argc, char const *argv[]) {

        
        return 0;
}
