/*2) Използвайки имплементирания list от лекции напишете функция, която получава параметър текст и връща списък, елементите на който са думите от текста.

3) Напишете функция, която по даден list от думи(разбитият текст от задача 2) и дума търси дали тази дума се среща в list-a. Ако се среща, да върне индекса й(броейки отляво-надясно в list-a), ако не се среща да връща -1.

4) Използвайки имплементацията на list.h от лекции, имплементирайте фукнция getAt, която получава параметър list и число и връща(указател към) елементът от list-a на позиция числото(под позиция разбираме поредния номер на на елемента, започвайки от head-a). Ако листът не съдържа толкова елементи, да връща NULL.

5) Напишете функция duplicate, която получава параметър list и връща нов list, точно копие на оригиналния.

6) Напишете функция, която по дадени два list-a проверява дали те са идентични(имат еднакъв брой елементи и всеки елемент от първия list е равен на съответния от втория list.)
*/
